app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(user_params)

        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "bartholomew"], ["updated_at", "2020-06-10 03:51:42.193684"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        # debugger
        if @user.update(user_params)