app/models/user.rb

    def self.find_by_credentials(email, password)
    # def self.find_by_credentials(username, password)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bart@bart.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "EC6CXH0Ui1Hu2xVm-dpi1g"], ["updated_at", "2020-06-11 02:28:34.115132"], ["id", 1]]